In [ ]:
name = "Cobee"
name

In [ ]:
number = 4
number

# Machine Learning
There are 7 steps in machine learning :
- Collecting data
- Preparing data
- Choose a Model
- Training the Model
- Evaluating the Model
- Parameter Tuning
- Making prediction

In [66]:
import pandas as pd
data = [1,2,3]
df=pd.DataFrame(data)
df

#output: 0 is the column name since there is no name of column writen there

   0
0  1
1  2
2  3

In [67]:
student = [['Tom', 90], ['Jack', 80], ['Jill', 70]] #Create a 2D list for 2 Columns
data_student = pd.DataFrame(student, columns=['Name', 'Grade']) #'Name' , 'Grade' Is Column header

def grade_category(grade):
    if grade > 80:
        return 'A'
    elif grade >= 70:
        return 'B'
    else:
        return 'C'
    
data_student['Grade_Category']=data_student['Grade'].apply(grade_category)

data_student

   Name  Grade Grade_Category
0   Tom     90              A
1  Jack     80              B
2  Jill     70              B

In [68]:
data_student['Name']

0     Tom
1    Jack
2    Jill
Name: Name, dtype: object

In [69]:
new_student = [['Sam', 60], ['Mary', 50], ['John', 40], ['Joseph', 30]]
new_student = pd.DataFrame(new_student, columns=['Name', 'Grade'])

# Concatenate new student data with the original
data_student = pd.concat([data_student, new_student], ignore_index=True)

# Apply the grade_category function to the new rows as well
data_student['Grade_Category'] = data_student['Grade'].apply(grade_category)

# Display the updated DataFrame
print(data_student)

     Name  Grade Grade_Category
0     Tom     90              A
1    Jack     80              B
2    Jill     70              B
3     Sam     60              C
4    Mary     50              C
5    John     40              C
6  Joseph     30              C

In [70]:
data_student.head(3)

   Name  Grade Grade_Category
0   Tom     90              A
1  Jack     80              B
2  Jill     70              B

In [71]:
data_student.tail(3)

     Name  Grade Grade_Category
4    Mary     50              C
5    John     40              C
6  Joseph     30              C

In [72]:
data_student.to_csv('data_student.csv')

In [73]:
person = [['Jhony', 'Swimming', 'male'], ['Catherine', 'Drawing', 'female'], ['Jack', 'Gaming', 'male']]
data_person = pd.DataFrame(person, columns=['Name', 'Hobby', 'Gender'])
data_person

        Name     Hobby  Gender
0      Jhony  Swimming    male
1  Catherine   Drawing  female
2       Jack    Gaming    male